Revit 2024 API
IFCExtrusionCalculatorOptions.CustomAxis Property
 The custom axis to try (if extrusionAxes includes an option for a custom direction).
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public XYZ CustomAxis { get; set; }
Visual Basic
Public Property CustomAxis As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ CustomAxis {
	XYZ^ get ();
	void set (XYZ^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
IFCExtrusionCalculatorOptions Class
Autodesk.Revit.DB.IFC Namespace